k6/results/nestjs_load_20260112_135747_summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./tests/nestjs-api.js
        output: json (./results/nestjs_load_20260112_135747.json)

     scenarios: (100.00%) 1 scenario, 50 max VUs, 3m40s max duration (incl. graceful stop):
              * nestjs_test: Up to 50 looping VUs for 3m30s over 5 stages (gracefulRampDown: 10s, gracefulStop: 30s)

time="2026-01-12T14:01:26Z" level=info msg="Testing NestJS API at http://localhost:3000" source=console
time="2026-01-12T14:01:26Z" level=info msg="NestJS API is healthy, starting load test..." source=console

Run           [ 100% ] setup()
nestjs_test   [   0% ]

running (0m02.0s), 00/50 VUs, 0 complete and 0 interrupted iterations
nestjs_test   [   0% ] 00/50 VUs  0m00.2s/3m30.0s

running (0m03.0s), 00/50 VUs, 0 complete and 0 interrupted iterations
nestjs_test   [   1% ] 00/50 VUs  0m01.2s/3m30.0s

running (0m04.0s), 00/50 VUs, 0 complete and 0 interrupted iterations
nestjs_test   [   1% ] 00/50 VUs  0m02.2s/3m30.0s

running (0m05.0s), 01/50 VUs, 0 complete and 0 interrupted iterations
nestjs_test   [   2% ] 01/50 VUs  0m03.2s/3m30.0s

running (0m06.0s), 01/50 VUs, 0 complete and 0 interrupted iterations
nestjs_test   [   2% ] 01/50 VUs  0m04.2s/3m30.0s

running (0m07.0s), 01/50 VUs, 0 complete and 0 interrupted iterations
nestjs_test   [   2% ] 01/50 VUs  0m05.2s/3m30.0s

running (0m08.0s), 02/50 VUs, 0 complete and 0 interrupted iterations
nestjs_test   [   3% ] 02/50 VUs  0m06.2s/3m30.0s

running (0m09.0s), 02/50 VUs, 0 complete and 0 interrupted iterations
nestjs_test   [   3% ] 02/50 VUs  0m07.2s/3m30.0s

running (0m10.0s), 02/50 VUs, 1 complete and 0 interrupted iterations
nestjs_test   [   4% ] 02/50 VUs  0m08.2s/3m30.0s

running (0m11.0s), 03/50 VUs, 1 complete and 0 interrupted iterations
nestjs_test   [   4% ] 03/50 VUs  0m09.2s/3m30.0s

running (0m12.0s), 03/50 VUs, 1 complete and 0 interrupted iterations
nestjs_test   [   5% ] 03/50 VUs  0m10.2s/3m30.0s

running (0m13.0s), 03/50 VUs, 2 complete and 0 interrupted iterations
nestjs_test   [   5% ] 03/50 VUs  0m11.2s/3m30.0s

running (0m14.0s), 04/50 VUs, 2 complete and 0 interrupted iterations
nestjs_test   [   6% ] 04/50 VUs  0m12.2s/3m30.0s

running (0m15.0s), 04/50 VUs, 3 complete and 0 interrupted iterations
nestjs_test   [   6% ] 04/50 VUs  0m13.2s/3m30.0s

running (0m16.0s), 04/50 VUs, 4 complete and 0 interrupted iterations
nestjs_test   [   7% ] 04/50 VUs  0m14.2s/3m30.0s

running (0m17.0s), 05/50 VUs, 4 complete and 0 interrupted iterations
nestjs_test   [   7% ] 05/50 VUs  0m15.2s/3m30.0s

running (0m18.0s), 05/50 VUs, 5 complete and 0 interrupted iterations
nestjs_test   [   8% ] 05/50 VUs  0m16.2s/3m30.0s

running (0m19.0s), 05/50 VUs, 6 complete and 0 interrupted iterations
nestjs_test   [   8% ] 05/50 VUs  0m17.2s/3m30.0s

running (0m20.0s), 06/50 VUs, 7 complete and 0 interrupted iterations
nestjs_test   [   9% ] 06/50 VUs  0m18.2s/3m30.0s

running (0m21.0s), 06/50 VUs, 8 complete and 0 interrupted iterations
nestjs_test   [   9% ] 06/50 VUs  0m19.2s/3m30.0s

running (0m22.0s), 06/50 VUs, 11 complete and 0 interrupted iterations
nestjs_test   [  10% ] 06/50 VUs  0m20.2s/3m30.0s

running (0m23.0s), 07/50 VUs, 11 complete and 0 interrupted iterations
nestjs_test   [  10% ] 07/50 VUs  0m21.2s/3m30.0s

running (0m24.0s), 07/50 VUs, 11 complete and 0 interrupted iterations
nestjs_test   [  11% ] 07/50 VUs  0m22.2s/3m30.0s

running (0m25.0s), 07/50 VUs, 14 complete and 0 interrupted iterations
nestjs_test   [  11% ] 07/50 VUs  0m23.2s/3m30.0s

running (0m26.0s), 08/50 VUs, 14 complete and 0 interrupted iterations
nestjs_test   [  12% ] 08/50 VUs  0m24.2s/3m30.0s

running (0m27.0s), 08/50 VUs, 17 complete and 0 interrupted iterations
nestjs_test   [  12% ] 08/50 VUs  0m25.2s/3m30.0s

running (0m28.0s), 08/50 VUs, 18 complete and 0 interrupted iterations
nestjs_test   [  12% ] 08/50 VUs  0m26.2s/3m30.0s

running (0m29.0s), 09/50 VUs, 20 complete and 0 interrupted iterations
nestjs_test   [  13% ] 09/50 VUs  0m27.2s/3m30.0s

running (0m30.0s), 09/50 VUs, 21 complete and 0 interrupted iterations
nestjs_test   [  13% ] 09/50 VUs  0m28.2s/3m30.0s

running (0m31.0s), 09/50 VUs, 22 complete and 0 interrupted iterations
nestjs_test   [  14% ] 09/50 VUs  0m29.2s/3m30.0s

running (0m32.0s), 10/50 VUs, 24 complete and 0 interrupted iterations
nestjs_test   [  14% ] 10/50 VUs  0m30.2s/3m30.0s

running (0m33.0s), 10/50 VUs, 26 complete and 0 interrupted iterations
nestjs_test   [  15% ] 10/50 VUs  0m31.2s/3m30.0s

running (0m34.0s), 10/50 VUs, 30 complete and 0 interrupted iterations
nestjs_test   [  15% ] 10/50 VUs  0m32.2s/3m30.0s

running (0m35.0s), 10/50 VUs, 31 complete and 0 interrupted iterations
nestjs_test   [  16% ] 10/50 VUs  0m33.2s/3m30.0s

running (0m36.0s), 10/50 VUs, 32 complete and 0 interrupted iterations
nestjs_test   [  16% ] 10/50 VUs  0m34.2s/3m30.0s

running (0m37.0s), 10/50 VUs, 34 complete and 0 interrupted iterations
nestjs_test   [  17% ] 10/50 VUs  0m35.2s/3m30.0s

running (0m38.0s), 10/50 VUs, 37 complete and 0 interrupted iterations
nestjs_test   [  17% ] 10/50 VUs  0m36.2s/3m30.0s

running (0m39.0s), 10/50 VUs, 40 complete and 0 interrupted iterations
nestjs_test   [  18% ] 10/50 VUs  0m37.2s/3m30.0s

running (0m40.0s), 10/50 VUs, 41 complete and 0 interrupted iterations
nestjs_test   [  18% ] 10/50 VUs  0m38.2s/3m30.0s

running (0m41.0s), 10/50 VUs, 43 complete and 0 interrupted iterations
nestjs_test   [  19% ] 10/50 VUs  0m39.2s/3m30.0s

running (0m42.0s), 10/50 VUs, 46 complete and 0 interrupted iterations
nestjs_test   [  19% ] 10/50 VUs  0m40.2s/3m30.0s

running (0m43.0s), 10/50 VUs, 47 complete and 0 interrupted iterations
nestjs_test   [  20% ] 10/50 VUs  0m41.2s/3m30.0s

running (0m44.0s), 10/50 VUs, 51 complete and 0 interrupted iterations
nestjs_test   [  20% ] 10/50 VUs  0m42.2s/3m30.0s

running (0m45.0s), 10/50 VUs, 51 complete and 0 interrupted iterations
nestjs_test   [  21% ] 10/50 VUs  0m43.2s/3m30.0s

running (0m46.0s), 10/50 VUs, 54 complete and 0 interrupted iterations
nestjs_test   [  21% ] 10/50 VUs  0m44.2s/3m30.0s

running (0m47.0s), 10/50 VUs, 55 complete and 0 interrupted iterations
nestjs_test   [  22% ] 10/50 VUs  0m45.2s/3m30.0s

running (0m48.0s), 10/50 VUs, 57 complete and 0 interrupted iterations
nestjs_test   [  22% ] 10/50 VUs  0m46.2s/3m30.0s

running (0m49.0s), 10/50 VUs, 61 complete and 0 interrupted iterations
nestjs_test   [  22% ] 10/50 VUs  0m47.2s/3m30.0s

running (0m50.0s), 10/50 VUs, 63 complete and 0 interrupted iterations
nestjs_test   [  23% ] 10/50 VUs  0m48.2s/3m30.0s

running (0m51.0s), 10/50 VUs, 64 complete and 0 interrupted iterations
nestjs_test   [  23% ] 10/50 VUs  0m49.2s/3m30.0s

running (0m52.0s), 10/50 VUs, 66 complete and 0 interrupted iterations
nestjs_test   [  24% ] 10/50 VUs  0m50.2s/3m30.0s

running (0m53.0s), 10/50 VUs, 69 complete and 0 interrupted iterations
nestjs_test   [  24% ] 10/50 VUs  0m51.2s/3m30.0s

running (0m54.0s), 10/50 VUs, 70 complete and 0 interrupted iterations
nestjs_test   [  25% ] 10/50 VUs  0m52.2s/3m30.0s

running (0m55.0s), 10/50 VUs, 73 complete and 0 interrupted iterations
nestjs_test   [  25% ] 10/50 VUs  0m53.2s/3m30.0s

running (0m56.0s), 10/50 VUs, 75 complete and 0 interrupted iterations
nestjs_test   [  26% ] 10/50 VUs  0m54.2s/3m30.0s

running (0m57.0s), 10/50 VUs, 77 complete and 0 interrupted iterations
nestjs_test   [  26% ] 10/50 VUs  0m55.2s/3m30.0s

running (0m58.0s), 10/50 VUs, 79 complete and 0 interrupted iterations
nestjs_test   [  27% ] 10/50 VUs  0m56.2s/3m30.0s

running (0m59.0s), 10/50 VUs, 81 complete and 0 interrupted iterations
nestjs_test   [  27% ] 10/50 VUs  0m57.2s/3m30.0s

running (1m00.0s), 10/50 VUs, 82 complete and 0 interrupted iterations
nestjs_test   [  28% ] 10/50 VUs  0m58.2s/3m30.0s

running (1m01.0s), 10/50 VUs, 84 complete and 0 interrupted iterations
nestjs_test   [  28% ] 10/50 VUs  0m59.2s/3m30.0s

running (1m02.0s), 10/50 VUs, 87 complete and 0 interrupted iterations
nestjs_test   [  29% ] 10/50 VUs  1m00.2s/3m30.0s

running (1m02.9s), 10/50 VUs, 89 complete and 0 interrupted iterations
nestjs_test   [  29% ] 10/50 VUs  1m01.2s/3m30.0s

running (1m04.0s), 10/50 VUs, 91 complete and 0 interrupted iterations
nestjs_test   [  30% ] 10/50 VUs  1m02.2s/3m30.0s

running (1m04.9s), 10/50 VUs, 93 complete and 0 interrupted iterations
nestjs_test   [  30% ] 10/50 VUs  1m03.2s/3m30.0s

running (1m06.0s), 10/50 VUs, 94 complete and 0 interrupted iterations
nestjs_test   [  31% ] 10/50 VUs  1m04.2s/3m30.0s

running (1m07.0s), 10/50 VUs, 95 complete and 0 interrupted iterations
nestjs_test   [  31% ] 10/50 VUs  1m05.2s/3m30.0s

running (1m08.0s), 10/50 VUs, 98 complete and 0 interrupted iterations
nestjs_test   [  32% ] 10/50 VUs  1m06.2s/3m30.0s

running (1m08.9s), 10/50 VUs, 100 complete and 0 interrupted iterations
nestjs_test   [  32% ] 10/50 VUs  1m07.2s/3m30.0s

running (1m09.9s), 10/50 VUs, 101 complete and 0 interrupted iterations
nestjs_test   [  32% ] 10/50 VUs  1m08.2s/3m30.0s

running (1m11.0s), 10/50 VUs, 105 complete and 0 interrupted iterations
nestjs_test   [  33% ] 10/50 VUs  1m09.2s/3m30.0s

running (1m11.9s), 10/50 VUs, 105 complete and 0 interrupted iterations
nestjs_test   [  33% ] 10/50 VUs  1m10.2s/3m30.0s

running (1m13.0s), 10/50 VUs, 107 complete and 0 interrupted iterations
nestjs_test   [  34% ] 10/50 VUs  1m11.2s/3m30.0s

running (1m13.9s), 10/50 VUs, 109 complete and 0 interrupted iterations
nestjs_test   [  34% ] 10/50 VUs  1m12.2s/3m30.0s

running (1m15.0s), 10/50 VUs, 111 complete and 0 interrupted iterations
nestjs_test   [  35% ] 10/50 VUs  1m13.2s/3m30.0s

running (1m16.0s), 10/50 VUs, 115 complete and 0 interrupted iterations
nestjs_test   [  35% ] 10/50 VUs  1m14.2s/3m30.0s

running (1m17.0s), 10/50 VUs, 116 complete and 0 interrupted iterations
nestjs_test   [  36% ] 10/50 VUs  1m15.2s/3m30.0s

running (1m18.0s), 10/50 VUs, 119 complete and 0 interrupted iterations
nestjs_test   [  36% ] 10/50 VUs  1m16.2s/3m30.0s

running (1m19.0s), 10/50 VUs, 119 complete and 0 interrupted iterations
nestjs_test   [  37% ] 10/50 VUs  1m17.2s/3m30.0s

running (1m19.9s), 10/50 VUs, 121 complete and 0 interrupted iterations
nestjs_test   [  37% ] 10/50 VUs  1m18.2s/3m30.0s

running (1m20.9s), 10/50 VUs, 122 complete and 0 interrupted iterations
nestjs_test   [  38% ] 10/50 VUs  1m19.2s/3m30.0s

running (1m21.9s), 10/50 VUs, 125 complete and 0 interrupted iterations
nestjs_test   [  38% ] 10/50 VUs  1m20.2s/3m30.0s

running (1m23.0s), 10/50 VUs, 127 complete and 0 interrupted iterations
nestjs_test   [  39% ] 10/50 VUs  1m21.3s/3m30.0s

running (1m23.9s), 10/50 VUs, 129 complete and 0 interrupted iterations
nestjs_test   [  39% ] 10/50 VUs  1m22.2s/3m30.0s

running (1m24.9s), 10/50 VUs, 129 complete and 0 interrupted iterations
nestjs_test   [  40% ] 10/50 VUs  1m23.2s/3m30.0s

running (1m25.9s), 10/50 VUs, 130 complete and 0 interrupted iterations
nestjs_test   [  40% ] 10/50 VUs  1m24.2s/3m30.0s

running (1m26.9s), 10/50 VUs, 132 complete and 0 interrupted iterations
nestjs_test   [  41% ] 10/50 VUs  1m25.2s/3m30.0s

running (1m27.9s), 10/50 VUs, 135 complete and 0 interrupted iterations
nestjs_test   [  41% ] 10/50 VUs  1m26.2s/3m30.0s

running (1m28.9s), 10/50 VUs, 138 complete and 0 interrupted iterations
nestjs_test   [  42% ] 10/50 VUs  1m27.2s/3m30.0s

running (1m29.9s), 10/50 VUs, 139 complete and 0 interrupted iterations
nestjs_test   [  42% ] 10/50 VUs  1m28.2s/3m30.0s

running (1m30.9s), 10/50 VUs, 141 complete and 0 interrupted iterations
nestjs_test   [  42% ] 10/50 VUs  1m29.2s/3m30.0s

running (1m31.9s), 10/50 VUs, 143 complete and 0 interrupted iterations
nestjs_test   [  43% ] 10/50 VUs  1m30.2s/3m30.0s

running (1m32.9s), 11/50 VUs, 145 complete and 0 interrupted iterations
nestjs_test   [  43% ] 11/50 VUs  1m31.2s/3m30.0s

running (1m33.9s), 12/50 VUs, 148 complete and 0 interrupted iterations
nestjs_test   [  44% ] 12/50 VUs  1m32.2s/3m30.0s

running (1m34.9s), 14/50 VUs, 149 complete and 0 interrupted iterations
nestjs_test   [  44% ] 14/50 VUs  1m33.2s/3m30.0s

running (1m35.9s), 15/50 VUs, 151 complete and 0 interrupted iterations
nestjs_test   [  45% ] 15/50 VUs  1m34.2s/3m30.0s

running (1m36.9s), 16/50 VUs, 153 complete and 0 interrupted iterations
nestjs_test   [  45% ] 16/50 VUs  1m35.2s/3m30.0s

running (1m37.9s), 18/50 VUs, 157 complete and 0 interrupted iterations
nestjs_test   [  46% ] 18/50 VUs  1m36.2s/3m30.0s

running (1m38.9s), 19/50 VUs, 157 complete and 0 interrupted iterations
nestjs_test   [  46% ] 19/50 VUs  1m37.2s/3m30.0s

running (1m39.9s), 20/50 VUs, 162 complete and 0 interrupted iterations
nestjs_test   [  47% ] 20/50 VUs  1m38.2s/3m30.0s

running (1m40.9s), 22/50 VUs, 165 complete and 0 interrupted iterations
nestjs_test   [  47% ] 22/50 VUs  1m39.2s/3m30.0s

running (1m41.9s), 23/50 VUs, 166 complete and 0 interrupted iterations
nestjs_test   [  48% ] 23/50 VUs  1m40.2s/3m30.0s

running (1m42.9s), 24/50 VUs, 171 complete and 0 interrupted iterations
nestjs_test   [  48% ] 24/50 VUs  1m41.2s/3m30.0s

running (1m43.9s), 26/50 VUs, 175 complete and 0 interrupted iterations
nestjs_test   [  49% ] 26/50 VUs  1m42.2s/3m30.0s

running (1m44.9s), 27/50 VUs, 181 complete and 0 interrupted iterations
nestjs_test   [  49% ] 27/50 VUs  1m43.2s/3m30.0s

running (1m45.9s), 28/50 VUs, 183 complete and 0 interrupted iterations
nestjs_test   [  50% ] 28/50 VUs  1m44.2s/3m30.0s

running (1m46.9s), 30/50 VUs, 188 complete and 0 interrupted iterations
nestjs_test   [  50% ] 30/50 VUs  1m45.2s/3m30.0s

running (1m47.9s), 31/50 VUs, 190 complete and 0 interrupted iterations
nestjs_test   [  51% ] 31/50 VUs  1m46.2s/3m30.0s

running (1m48.9s), 32/50 VUs, 195 complete and 0 interrupted iterations
nestjs_test   [  51% ] 32/50 VUs  1m47.2s/3m30.0s

running (1m50.0s), 34/50 VUs, 201 complete and 0 interrupted iterations
nestjs_test   [  52% ] 34/50 VUs  1m48.2s/3m30.0s

running (1m50.9s), 35/50 VUs, 207 complete and 0 interrupted iterations
nestjs_test   [  52% ] 35/50 VUs  1m49.2s/3m30.0s

running (1m51.9s), 36/50 VUs, 212 complete and 0 interrupted iterations
nestjs_test   [  52% ] 36/50 VUs  1m50.2s/3m30.0s

running (1m53.0s), 38/50 VUs, 215 complete and 0 interrupted iterations
nestjs_test   [  53% ] 38/50 VUs  1m51.2s/3m30.0s

running (1m53.9s), 39/50 VUs, 223 complete and 0 interrupted iterations
nestjs_test   [  53% ] 39/50 VUs  1m52.2s/3m30.0s

running (1m54.9s), 40/50 VUs, 227 complete and 0 interrupted iterations
nestjs_test   [  54% ] 40/50 VUs  1m53.2s/3m30.0s

running (1m55.9s), 42/50 VUs, 230 complete and 0 interrupted iterations
nestjs_test   [  54% ] 42/50 VUs  1m54.2s/3m30.0s

running (1m56.9s), 43/50 VUs, 237 complete and 0 interrupted iterations
nestjs_test   [  55% ] 43/50 VUs  1m55.2s/3m30.0s

running (1m57.9s), 44/50 VUs, 247 complete and 0 interrupted iterations
nestjs_test   [  55% ] 44/50 VUs  1m56.2s/3m30.0s

running (1m58.9s), 46/50 VUs, 249 complete and 0 interrupted iterations
nestjs_test   [  56% ] 46/50 VUs  1m57.2s/3m30.0s

running (1m59.9s), 47/50 VUs, 251 complete and 0 interrupted iterations
nestjs_test   [  56% ] 47/50 VUs  1m58.2s/3m30.0s

running (2m00.9s), 48/50 VUs, 258 complete and 0 interrupted iterations
nestjs_test   [  57% ] 48/50 VUs  1m59.2s/3m30.0s

running (2m01.9s), 50/50 VUs, 268 complete and 0 interrupted iterations
nestjs_test   [  57% ] 50/50 VUs  2m00.2s/3m30.0s

running (2m02.9s), 50/50 VUs, 274 complete and 0 interrupted iterations
nestjs_test   [  58% ] 50/50 VUs  2m01.2s/3m30.0s

running (2m03.9s), 50/50 VUs, 278 complete and 0 interrupted iterations
nestjs_test   [  58% ] 50/50 VUs  2m02.2s/3m30.0s

running (2m04.9s), 50/50 VUs, 287 complete and 0 interrupted iterations
nestjs_test   [  59% ] 50/50 VUs  2m03.2s/3m30.0s

running (2m05.9s), 50/50 VUs, 296 complete and 0 interrupted iterations
nestjs_test   [  59% ] 50/50 VUs  2m04.2s/3m30.0s

running (2m06.9s), 50/50 VUs, 301 complete and 0 interrupted iterations
nestjs_test   [  60% ] 50/50 VUs  2m05.2s/3m30.0s

running (2m07.9s), 50/50 VUs, 305 complete and 0 interrupted iterations
nestjs_test   [  60% ] 50/50 VUs  2m06.2s/3m30.0s

running (2m08.9s), 50/50 VUs, 315 complete and 0 interrupted iterations
nestjs_test   [  61% ] 50/50 VUs  2m07.2s/3m30.0s

running (2m09.9s), 50/50 VUs, 316 complete and 0 interrupted iterations
nestjs_test   [  61% ] 50/50 VUs  2m08.2s/3m30.0s

running (2m10.9s), 50/50 VUs, 325 complete and 0 interrupted iterations
nestjs_test   [  62% ] 50/50 VUs  2m09.2s/3m30.0s

running (2m11.9s), 50/50 VUs, 328 complete and 0 interrupted iterations
nestjs_test   [  62% ] 50/50 VUs  2m10.2s/3m30.0s

running (2m12.9s), 50/50 VUs, 333 complete and 0 interrupted iterations
nestjs_test   [  62% ] 50/50 VUs  2m11.2s/3m30.0s

running (2m13.9s), 50/50 VUs, 345 complete and 0 interrupted iterations
nestjs_test   [  63% ] 50/50 VUs  2m12.2s/3m30.0s

running (2m14.9s), 50/50 VUs, 358 complete and 0 interrupted iterations
nestjs_test   [  63% ] 50/50 VUs  2m13.2s/3m30.0s

running (2m15.9s), 50/50 VUs, 367 complete and 0 interrupted iterations
nestjs_test   [  64% ] 50/50 VUs  2m14.2s/3m30.0s

running (2m16.9s), 50/50 VUs, 374 complete and 0 interrupted iterations
nestjs_test   [  64% ] 50/50 VUs  2m15.2s/3m30.0s

running (2m17.9s), 50/50 VUs, 383 complete and 0 interrupted iterations
nestjs_test   [  65% ] 50/50 VUs  2m16.2s/3m30.0s

running (2m18.9s), 50/50 VUs, 394 complete and 0 interrupted iterations
nestjs_test   [  65% ] 50/50 VUs  2m17.2s/3m30.0s

running (2m19.9s), 50/50 VUs, 401 complete and 0 interrupted iterations
nestjs_test   [  66% ] 50/50 VUs  2m18.2s/3m30.0s

running (2m20.9s), 50/50 VUs, 409 complete and 0 interrupted iterations
nestjs_test   [  66% ] 50/50 VUs  2m19.2s/3m30.0s

running (2m21.9s), 50/50 VUs, 415 complete and 0 interrupted iterations
nestjs_test   [  67% ] 50/50 VUs  2m20.2s/3m30.0s

running (2m22.9s), 50/50 VUs, 420 complete and 0 interrupted iterations
nestjs_test   [  67% ] 50/50 VUs  2m21.2s/3m30.0s

running (2m23.9s), 50/50 VUs, 424 complete and 0 interrupted iterations
nestjs_test   [  68% ] 50/50 VUs  2m22.2s/3m30.0s

running (2m24.9s), 50/50 VUs, 429 complete and 0 interrupted iterations
nestjs_test   [  68% ] 50/50 VUs  2m23.2s/3m30.0s

running (2m25.9s), 50/50 VUs, 432 complete and 0 interrupted iterations
nestjs_test   [  69% ] 50/50 VUs  2m24.2s/3m30.0s

running (2m26.9s), 50/50 VUs, 436 complete and 0 interrupted iterations
nestjs_test   [  69% ] 50/50 VUs  2m25.2s/3m30.0s

running (2m27.9s), 50/50 VUs, 440 complete and 0 interrupted iterations
nestjs_test   [  70% ] 50/50 VUs  2m26.2s/3m30.0s

running (2m28.9s), 50/50 VUs, 449 complete and 0 interrupted iterations
nestjs_test   [  70% ] 50/50 VUs  2m27.2s/3m30.0s

running (2m29.9s), 50/50 VUs, 460 complete and 0 interrupted iterations
nestjs_test   [  71% ] 50/50 VUs  2m28.2s/3m30.0s

running (2m30.9s), 50/50 VUs, 464 complete and 0 interrupted iterations
nestjs_test   [  71% ] 50/50 VUs  2m29.2s/3m30.0s

running (2m31.9s), 50/50 VUs, 470 complete and 0 interrupted iterations
nestjs_test   [  72% ] 50/50 VUs  2m30.2s/3m30.0s

running (2m32.9s), 50/50 VUs, 473 complete and 0 interrupted iterations
nestjs_test   [  72% ] 50/50 VUs  2m31.2s/3m30.0s

running (2m33.9s), 50/50 VUs, 479 complete and 0 interrupted iterations
nestjs_test   [  72% ] 50/50 VUs  2m32.2s/3m30.0s

running (2m34.9s), 50/50 VUs, 483 complete and 0 interrupted iterations
nestjs_test   [  73% ] 50/50 VUs  2m33.2s/3m30.0s

running (2m35.9s), 50/50 VUs, 484 complete and 0 interrupted iterations
nestjs_test   [  73% ] 50/50 VUs  2m34.2s/3m30.0s

running (2m36.9s), 50/50 VUs, 495 complete and 0 interrupted iterations
nestjs_test   [  74% ] 50/50 VUs  2m35.2s/3m30.0s

running (2m37.9s), 50/50 VUs, 501 complete and 0 interrupted iterations
nestjs_test   [  74% ] 50/50 VUs  2m36.2s/3m30.0s

running (2m38.9s), 50/50 VUs, 510 complete and 0 interrupted iterations
nestjs_test   [  75% ] 50/50 VUs  2m37.2s/3m30.0s

running (2m39.9s), 50/50 VUs, 516 complete and 0 interrupted iterations
nestjs_test   [  75% ] 50/50 VUs  2m38.2s/3m30.0s

running (2m40.9s), 50/50 VUs, 525 complete and 0 interrupted iterations
nestjs_test   [  76% ] 50/50 VUs  2m39.2s/3m30.0s

running (2m41.9s), 50/50 VUs, 529 complete and 0 interrupted iterations
nestjs_test   [  76% ] 50/50 VUs  2m40.2s/3m30.0s

running (2m42.9s), 50/50 VUs, 532 complete and 0 interrupted iterations
nestjs_test   [  77% ] 50/50 VUs  2m41.2s/3m30.0s

running (2m43.9s), 50/50 VUs, 539 complete and 0 interrupted iterations
nestjs_test   [  77% ] 50/50 VUs  2m42.2s/3m30.0s

running (2m44.9s), 50/50 VUs, 551 complete and 0 interrupted iterations
nestjs_test   [  78% ] 50/50 VUs  2m43.2s/3m30.0s

running (2m45.9s), 50/50 VUs, 558 complete and 0 interrupted iterations
nestjs_test   [  78% ] 50/50 VUs  2m44.2s/3m30.0s

running (2m46.9s), 50/50 VUs, 564 complete and 0 interrupted iterations
nestjs_test   [  79% ] 50/50 VUs  2m45.2s/3m30.0s

running (2m47.9s), 50/50 VUs, 570 complete and 0 interrupted iterations
nestjs_test   [  79% ] 50/50 VUs  2m46.2s/3m30.0s

running (2m48.9s), 50/50 VUs, 572 complete and 0 interrupted iterations
nestjs_test   [  80% ] 50/50 VUs  2m47.2s/3m30.0s

running (2m49.9s), 50/50 VUs, 578 complete and 0 interrupted iterations
nestjs_test   [  80% ] 50/50 VUs  2m48.2s/3m30.0s

running (2m50.9s), 50/50 VUs, 582 complete and 0 interrupted iterations
nestjs_test   [  81% ] 50/50 VUs  2m49.2s/3m30.0s

running (2m51.9s), 50/50 VUs, 589 complete and 0 interrupted iterations
nestjs_test   [  81% ] 50/50 VUs  2m50.2s/3m30.0s

running (2m52.9s), 50/50 VUs, 593 complete and 0 interrupted iterations
nestjs_test   [  82% ] 50/50 VUs  2m51.2s/3m30.0s

running (2m53.9s), 50/50 VUs, 601 complete and 0 interrupted iterations
nestjs_test   [  82% ] 50/50 VUs  2m52.2s/3m30.0s

running (2m54.9s), 50/50 VUs, 603 complete and 0 interrupted iterations
nestjs_test   [  82% ] 50/50 VUs  2m53.2s/3m30.0s

running (2m55.9s), 50/50 VUs, 610 complete and 0 interrupted iterations
nestjs_test   [  83% ] 50/50 VUs  2m54.2s/3m30.0s

running (2m56.9s), 50/50 VUs, 620 complete and 0 interrupted iterations
nestjs_test   [  83% ] 50/50 VUs  2m55.2s/3m30.0s

running (2m57.9s), 50/50 VUs, 624 complete and 0 interrupted iterations
nestjs_test   [  84% ] 50/50 VUs  2m56.2s/3m30.0s

running (2m58.9s), 50/50 VUs, 628 complete and 0 interrupted iterations
nestjs_test   [  84% ] 50/50 VUs  2m57.2s/3m30.0s

running (2m59.9s), 50/50 VUs, 635 complete and 0 interrupted iterations
nestjs_test   [  85% ] 50/50 VUs  2m58.2s/3m30.0s

running (3m00.9s), 50/50 VUs, 639 complete and 0 interrupted iterations
nestjs_test   [  85% ] 50/50 VUs  2m59.2s/3m30.0s

running (3m01.9s), 50/50 VUs, 644 complete and 0 interrupted iterations
nestjs_test   [  86% ] 50/50 VUs  3m00.2s/3m30.0s

running (3m02.9s), 50/50 VUs, 645 complete and 0 interrupted iterations
nestjs_test   [  86% ] 50/50 VUs  3m01.2s/3m30.0s

running (3m03.9s), 50/50 VUs, 650 complete and 0 interrupted iterations
nestjs_test   [  87% ] 50/50 VUs  3m02.2s/3m30.0s

running (3m04.9s), 49/50 VUs, 655 complete and 0 interrupted iterations
nestjs_test   [  87% ] 49/50 VUs  3m03.2s/3m30.0s

running (3m05.9s), 48/50 VUs, 664 complete and 0 interrupted iterations
nestjs_test   [  88% ] 48/50 VUs  3m04.2s/3m30.0s

running (3m06.9s), 46/50 VUs, 670 complete and 0 interrupted iterations
nestjs_test   [  88% ] 46/50 VUs  3m05.2s/3m30.0s

running (3m07.9s), 43/50 VUs, 679 complete and 0 interrupted iterations
nestjs_test   [  89% ] 43/50 VUs  3m06.2s/3m30.0s

running (3m08.9s), 42/50 VUs, 685 complete and 0 interrupted iterations
nestjs_test   [  89% ] 42/50 VUs  3m07.2s/3m30.0s

running (3m09.9s), 41/50 VUs, 691 complete and 0 interrupted iterations
nestjs_test   [  90% ] 41/50 VUs  3m08.2s/3m30.0s

running (3m10.9s), 40/50 VUs, 695 complete and 0 interrupted iterations
nestjs_test   [  90% ] 40/50 VUs  3m09.2s/3m30.0s

running (3m11.9s), 40/50 VUs, 697 complete and 0 interrupted iterations
nestjs_test   [  91% ] 40/50 VUs  3m10.2s/3m30.0s

running (3m12.9s), 39/50 VUs, 705 complete and 0 interrupted iterations
nestjs_test   [  91% ] 39/50 VUs  3m11.2s/3m30.0s

running (3m13.9s), 37/50 VUs, 713 complete and 0 interrupted iterations
nestjs_test   [  92% ] 37/50 VUs  3m12.2s/3m30.0s

running (3m14.9s), 33/50 VUs, 724 complete and 0 interrupted iterations
nestjs_test   [  92% ] 33/50 VUs  3m13.2s/3m30.0s

running (3m15.9s), 33/50 VUs, 729 complete and 0 interrupted iterations
nestjs_test   [  92% ] 33/50 VUs  3m14.2s/3m30.0s

running (3m16.9s), 31/50 VUs, 733 complete and 0 interrupted iterations
nestjs_test   [  93% ] 31/50 VUs  3m15.2s/3m30.0s

running (3m17.9s), 30/50 VUs, 739 complete and 0 interrupted iterations
nestjs_test   [  93% ] 30/50 VUs  3m16.2s/3m30.0s

running (3m18.9s), 27/50 VUs, 747 complete and 0 interrupted iterations
nestjs_test   [  94% ] 27/50 VUs  3m17.2s/3m30.0s

running (3m19.9s), 24/50 VUs, 754 complete and 0 interrupted iterations
nestjs_test   [  94% ] 24/50 VUs  3m18.2s/3m30.0s

running (3m20.9s), 23/50 VUs, 758 complete and 0 interrupted iterations
nestjs_test   [  95% ] 23/50 VUs  3m19.2s/3m30.0s

running (3m21.9s), 21/50 VUs, 762 complete and 0 interrupted iterations
nestjs_test   [  95% ] 21/50 VUs  3m20.2s/3m30.0s

running (3m22.9s), 19/50 VUs, 766 complete and 0 interrupted iterations
nestjs_test   [  96% ] 19/50 VUs  3m21.2s/3m30.0s

running (3m23.9s), 19/50 VUs, 771 complete and 0 interrupted iterations
nestjs_test   [  96% ] 19/50 VUs  3m22.2s/3m30.0s

running (3m24.9s), 15/50 VUs, 779 complete and 0 interrupted iterations
nestjs_test   [  97% ] 15/50 VUs  3m23.2s/3m30.0s

running (3m25.9s), 13/50 VUs, 782 complete and 0 interrupted iterations
nestjs_test   [  97% ] 13/50 VUs  3m24.2s/3m30.0s

running (3m26.9s), 12/50 VUs, 784 complete and 0 interrupted iterations
nestjs_test   [  98% ] 12/50 VUs  3m25.2s/3m30.0s

running (3m27.9s), 11/50 VUs, 788 complete and 0 interrupted iterations
nestjs_test   [  98% ] 11/50 VUs  3m26.2s/3m30.0s

running (3m28.9s), 09/50 VUs, 791 complete and 0 interrupted iterations
nestjs_test   [  99% ] 09/50 VUs  3m27.2s/3m30.0s

running (3m29.9s), 08/50 VUs, 794 complete and 0 interrupted iterations
nestjs_test   [  99% ] 08/50 VUs  3m28.2s/3m30.0s

running (3m30.9s), 07/50 VUs, 795 complete and 0 interrupted iterations
nestjs_test   [ 100% ] 07/50 VUs  3m29.2s/3m30.0s

running (3m31.9s), 06/50 VUs, 797 complete and 0 interrupted iterations
nestjs_test ↓ [ 100% ] 06/50 VUs  3m30s

running (3m32.9s), 03/50 VUs, 800 complete and 0 interrupted iterations
nestjs_test ↓ [ 100% ] 06/50 VUs  3m30s

running (3m33.9s), 02/50 VUs, 801 complete and 0 interrupted iterations
nestjs_test ↓ [ 100% ] 06/50 VUs  3m30s

running (3m34.9s), 01/50 VUs, 802 complete and 0 interrupted iterations
nestjs_test ↓ [ 100% ] 06/50 VUs  3m30s
time="2026-01-12T14:05:02Z" level=info msg="NestJS load test completed" source=console
time="2026-01-12T14:05:02Z" level=info msg="Admin user: admin_1768226486966@loadtest.com" source=console


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<500' p(95)=2.18s
    ✗ 'p(99)<1000' p(99)=3.14s

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    http_reqs
    ✓ 'rate>10' rate=14.889916/s

    nestjs_auth_duration
    ✗ 'p(95)<300' p(95)=2225.8

    nestjs_crud_duration
    ✗ 'p(95)<200' p(95)=2102.4

    nestjs_errors
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 6427    29.775199/s
    checks_succeeded...: 100.00% 6427 out of 6427
    checks_failed......: 0.00%   0 out of 6427

    ✓ health check status is 200
    ✓ register status is 201
    ✓ register returns tokens
    ✓ register has access token
    ✓ register has refresh token
    ✓ login status is 200
    ✓ login has access token
    ✓ refresh status is 200
    ✓ refresh has new access token
    ✓ get users status is 200

    CUSTOM
    nestjs_auth_duration...........: avg=621.519718 min=2      med=302      max=4136   p(90)=1732.4 p(95)=2225.8 p(99)=3466.88
    nestjs_crud_duration...........: avg=707.296389 min=64     med=472      max=3254   p(90)=1678.8 p(95)=2102.4 p(99)=2887.06
    nestjs_errors..................: 0.00%  0 out of 3212

    HTTP
    http_req_duration..............: avg=642.81ms   min=1.81ms med=345.15ms max=4.13s  p(90)=1.71s  p(95)=2.18s  p(99)=3.14s  
      { expected_response:true }...: avg=642.81ms   min=1.81ms med=345.15ms max=4.13s  p(90)=1.71s  p(95)=2.18s  p(99)=3.14s  
    http_req_failed................: 0.00%  0 out of 3214
    http_reqs......................: 3214   14.889916/s

    EXECUTION
    iteration_duration.............: avg=6.88s      min=3.53s  med=6.71s    max=12.38s p(90)=9.33s  p(95)=9.92s  p(99)=10.82s 
    iterations.....................: 803    3.720163/s
    vus............................: 1      min=0         max=50
    vus_max........................: 50     min=50        max=50

    NETWORK
    data_received..................: 2.4 GB 11 MB/s
    data_sent......................: 968 kB 4.5 kB/s



running (3m35.9s), 00/50 VUs, 803 complete and 0 interrupted iterations
nestjs_test ✓ [ 100% ] 00/50 VUs  3m30s
time="2026-01-12T14:05:02Z" level=error msg="thresholds on metrics 'http_req_duration, nestjs_auth_duration, nestjs_crud_duration' have been crossed"